战狂 = {
        'name': '战狂',
        '理之冠': ['战狂的鬼面', '.\\sywtj\\zk_g.png'],
        '空之杯': ['战狂的骨杯', '.\\sywtj\\zk_b.png'],
        '时之沙': ['战狂的时计', '.\\sywtj\\zk_s.png'],
        '死之羽': ['战狂的翎羽', '.\\sywtj\\zk_y.png'],
        '生之花': ['战狂的蔷薇', '.\\sywtj\\zk_h.png'],
        '套装效果': '暴击率提高12%\n生命值低于70%时，暴击率额外提高24%'
        }
流放者 = {
        'name': '流放者',
        '理之冠': ['流放者头冠', '.\\sywtj\\lfz_g.png'],
        '空之杯': ['流放者之杯', '.\\sywtj\\lfz_b.png'],
        '时之沙': ['流放者怀表', '.\\sywtj\\lfz_s.png'],
        '死之羽': ['流放者之羽', '.\\sywtj\\lfz_y.png'],
        '生之花': ['流放者之花', '.\\sywtj\\lfz_h.png'],
        '套装效果': '元素充能效率提高20%\n施放元素爆发后，每2秒为队伍中所有角色（不包括自己）恢复2点元素能量。该效果持续6秒，无法叠加'
        }
行者之心 = {
        'name': '行者之心',
        '理之冠': ['感别之冠', '.\\sywtj\\xzzx_g.png'],
        '空之杯': ['异国之盏', '.\\sywtj\\xzzx_b.png'],
        '时之沙': ['逐光之石', '.\\sywtj\\xzzx_s.png'],
        '死之羽': ['归乡之羽', '.\\sywtj\\xzzx_y.png'],
        '生之花': ['故人之心', '.\\sywtj\\xzzx_h.png'],
        '套装效果': '攻击力提高18%\n重击的暴击率提高30%'
        }
祭冰之人 = {
        'name': '祭冰之人',
        '理之冠': ['祭冰礼冠', '.\\sywtj\\jbzr_g.png'],
        '套装效果': '受到的冰元素附着效果的持续时间减少40%'
        }
奇迹 = {
        'name': '奇迹',
        '理之冠': ['奇迹耳坠', '.\\sywtj\\qj_g.png'],
        '空之杯': ['奇迹之杯', '.\\sywtj\\qj_b.png'],
        '时之沙': ['奇迹之沙', '.\\sywtj\\qj_s.png'],
        '死之羽': ['奇迹之羽', '.\\sywtj\\qj_y.png'],
        '生之花': ['奇迹之花', '.\\sywtj\\qj_h.png'],
        '套装效果': '所有元素抗性提高20%\n受到某个元素类型的伤害后，相应的抗性提升30%，持续10秒。该效果每10秒只能触发一次'
        }
勇士之心 = {
        'name': '勇士之心',
        '理之冠': ['勇士的冠冕', '.\\sywtj\\yszx_g.png'],
        '空之杯': ['勇士的壮行', '.\\sywtj\\yszx_b.png'],
        '时之沙': ['勇士的坚毅', '.\\sywtj\\yszx_s.png'],
        '死之羽': ['勇士的期许', '.\\sywtj\\yszx_y.png'],
        '生之花': ['勇士的勋章', '.\\sywtj\\yszx_h.png'],
        '套装效果': '攻击力提高18%\n对生命值高于50%的敌人，造成的伤害增加30%'
        }
祭火之人 = {
        'name': '祭火之人',
        '理之冠': ['祭火礼冠', '.\\sywtj\\jhzr_g.png'],
        '套装效果': '受到的火元素附着效果的持续时间减少40%'
        }
教官 = {
        'name': '教官',
        '理之冠': ['教官的帽子', '.\\sywtj\\jg_g.png'],
        '空之杯': ['教官的茶杯', '.\\sywtj\\jg_b.png'],
        '时之沙': ['教官的怀表', '.\\sywtj\\jg_s.png'],
        '死之羽': ['教官的羽饰', '.\\sywtj\\jg_y.png'],
        '生之花': ['教官的胸花', '.\\sywtj\\jg_h.png'],
        '套装效果': '元素精通提高80点\n触发元素反应后。队伍中所有角色元素精通提高120点，持续8秒',
        }
赌徒 = {
        'name': '赌徒',
        '理之冠': ['赌徒的耳环', '.\\sywtj\\dt_g.png'],
        '空之杯': ['赌徒的骰蛊', '.\\sywtj\\dt_b.png'],
        '时之沙': ['赌徒的怀表', '.\\sywtj\\dt_s.png'],
        '死之羽': ['赌徒的羽饰', '.\\sywtj\\dt_y.png'],
        '生之花': ['赌徒的胸花', '.\\sywtj\\dt_h.png'],
        '套装效果': '元素战技造成的伤害提升20%\n击败敌人时，有100%概率清除元素战技的冷却时间。该效果每15秒至多触发一次'
        }
祭水之人 = {
        'name': '祭水之人',
        '理之冠': ['祭水礼冠', '.\\sywtj\\jszr_g.png'],
        '套装效果': ['受到的水元素附着效果的持续时间减少40%']
        }
学士 = {
        'name': '学士',
        '理之冠': ['学士的镜片', '.\\sywtj\\xs_g.png'],
        '空之杯': ['学士的墨杯', '.\\sywtj\\xs_b.png'],
        '时之沙': ['学士的时钟', '.\\sywtj\\xs_s.png'],
        '死之羽': ['学士的羽笔', '.\\sywtj\\xs_y.png'],
        '生之花': ['学士的书签', '.\\sywtj\\xs_h.png'],
        '套装效果': '元素充能效率提高20%\n获得元素微粒或元素晶球时，队伍中所有弓箭和法器角色额外恢复3点元素能量。该效果每3秒只能触发一次'
        }
武人 = {
        'name': '武人',
        '理之冠': ['武人的头巾', '.\\sywtj\\wr_g.png'],
        '空之杯': ['武人的酒杯', '.\\sywtj\\wr_b.png'],
        '时之沙': ['武人的水漏', '.\\sywtj\\wr_s.png'],
        '死之羽': ['武人的羽饰', '.\\sywtj\\wr_y.png'],
        '生之花': ['武人的红花', '.\\sywtj\\wr_h.png'],
        '套装效果': '普通攻击与重击造成的伤害提高15%\n施放元素战技后的8秒内，普通攻击和重击造成的伤害提升25%'
        }
祭雷之人 = {
        'name': '祭雷之人',
        '理之冠': ['祭雷礼冠', '.\\sywtj\\jlzr_g.png'],
        '套装效果': '受到的雷元素附着效果的持续时间减少40%'
        }
守护之心 = {
        'name': '守护之心',
        '理之冠': ['守护束带', '.\\sywtj\\shzx_g.png'],
        '空之杯': ['守护之皿', '.\\sywtj\\shzx_b.png'],
        '时之沙': ['守护座钟', '.\\sywtj\\shzx_s.png'],
        '死之羽': ['守护徽印', '.\\sywtj\\shzx_y.png'],
        '生之花': ['守护之花', '.\\sywtj\\shzx_h.png'],
        '套装效果': '防御力提高30%\n队伍里每有不同一种元素类型的自己的角色，自身获得30%相应的元素抗性'
        }
逆飞的流星 = {
        'name': '逆飞的流星',
        '理之冠': ['夏祭之面', '.\\sywtj\\nfdlx_g.png'],
        '空之杯': ['夏祭水玉', '.\\sywtj\\nfdlx_b.png'],
        '时之沙': ['夏祭之刻', '.\\sywtj\\nfdlx_s.png'],
        '死之羽': ['夏祭终末', '.\\sywtj\\nfdlx_y.png'],
        '生之花': ['夏祭之花', '.\\sywtj\\nfdlx_h.png'],
        '套装效果': '护盾强效提高35\n处于护盾庇护下时，额外获得40%普通攻击和重击伤害加成'
        }
流浪大地的乐团 = {
        'name': '流浪大地的乐团',
        '理之冠': ['指挥的礼帽', '.\\sywtj\\lldddyt_g.png'],
        '空之杯': ['吟游者之壶', '.\\sywtj\\lldddyt_b.png'],
        '时之沙': ['终幕的时计', '.\\sywtj\\lldddyt_s.png'],
        '死之羽': ['琴师的箭羽', '.\\sywtj\\lldddyt_y.png'],
        '生之花': ['乐团的晨光', '.\\sywtj\\lldddyt_h.png'],
        '套装效果': '元素精通提高80点\n装备该圣遗物套装的角色为法器、弓箭角色时，角色重击造成的伤害提高35%'
        }
平息鸣雷的尊者 = {
        'name': '平息鸣雷的尊者',
        '理之冠': ['平雷之冠', '.\\sywtj\\pxlmdzz_g.png'],
        '空之杯': ['平雷之器', '.\\sywtj\\pxlmdzz_b.png'],
        '时之沙': ['平雷之刻', '.\\sywtj\\pxlmdzz_s.png'],
        '死之羽': ['平雷之羽', '.\\sywtj\\pxlmdzz_y.png'],
        '生之花': ['平雷之心', '.\\sywtj\\pxlmdzz_h.png'],
        '套装效果': '雷元素抗性提高40%\n对处于雷元素影响下的敌人造成的伤害提升35%'
        }
千岩牢固 = {
        'name': '千岩牢固',
        '理之冠': ['将帅兜鍪', '.\\sywtj\\qylg_g.png'],
        '空之杯': ['盟誓金爵', '.\\sywtj\\qylg_b.png'],
        '时之沙': ['金铜时晷', '.\\sywtj\\qylg_s.png'],
        '死之羽': ['昭武翎羽', '.\\sywtj\\qylg_y.png'],
        '生之花': ['勋绩之花', '.\\sywtj\\qylg_h.png'],
        '套装效果': '生命值提升20%\n元素战技命中敌人后，使队伍中附近的所有角色攻击力提升20%，护盾强效提升30%，持续3秒。该效果每0.5秒至多触发一次。装备此圣遗物套装效果的角色处于队伍后台时，依然能触发该效果'
        }
渡过烈火的贤人 = {
        'name': '渡过烈火的贤人',
        '理之冠': ['渡火者的智慧', '.\\sywtj\\dglhdxr_g.png'],
        '空之杯': ['渡火者的醒悟', '.\\sywtj\\dglhdxr_b.png'],
        '时之沙': ['渡火者的煎熬', '.\\sywtj\\dglhdxr_s.png'],
        '死之羽': ['渡火者的解脱', '.\\sywtj\\dglhdxr_y.png'],
        '生之花': ['渡火者的决绝', '.\\sywtj\\dglhdxr_h.png'],
        '套装效果': '火元素抗性提高40%\n对处于火元素影响下的敌人造成的伤害提升35%'
        }
被怜爱的少女 = {
        'name': '被怜爱的少女',
        '理之冠': ['少女易逝的芳颜', '.\\sywtj\\bladsn_g.png'],
        '空之杯': ['少女片刻的闲暇', '.\\sywtj\\bladsn_b.png'],
        '时之沙': ['少女苦短的良辰', '.\\sywtj\\bladsn_s.png'],
        '死之羽': ['少女飘摇的思念', '.\\sywtj\\bladsn_y.png'],
        '生之花': ['远方的少女之心', '.\\sywtj\\bladsn_h.png'],
        '套装效果': '角色造成的治疗效果提升15%\n施放元素战技或元素爆发后的10秒内，队伍中所有角色受治疗效果加成提高20%'
        }
炽烈的炎之魔女 = {
        'name': '炽烈的炎之魔女',
        '理之冠': ['焦灼的魔女帽', '.\\sywtj\\cldyzmn_g.png'],
        '空之杯': ['魔女的心之火', '.\\sywtj\\cldyzmn_b.png'],
        '时之沙': ['魔女破灭之时', '.\\sywtj\\cldyzmn_s.png'],
        '死之羽': ['魔女常燃之羽', '.\\sywtj\\cldyzmn_y.png'],
        '生之花': ['魔女的炎之花', '.\\sywtj\\cldyzmn_h.png'],
        '套装效果': '获得15%火元素伤害加成\n超载、燃烧反应造成的伤害提升40%，蒸发、融化反应的加成系数提高15%。施放元素战技后的10秒内，二件套的效果提高50%，该效果最多叠加3次'
        }
角斗士的终幕礼 = {
        'name': '角斗士的终幕礼',
        '理之冠': ['角斗士的凯旋', '.\\sywtj\\jdsdzml_g.png'],
        '空之杯': ['角斗士的酣醉', '.\\sywtj\\jdsdzml_b.png'],
        '时之沙': ['角斗士的希冀', '.\\sywtj\\jdsdzml_s.png'],
        '死之羽': ['角斗士的归宿', '.\\sywtj\\jdsdzml_y.png'],
        '生之花': ['角斗士的留恋', '.\\sywtj\\jdsdzml_h.png'],
        '套装效果': '攻击力提高18%\n装备该圣遗物套装的角色为单手剑、双手剑、长柄武器角色时，角色普通攻击造成的伤害提高35%'
        }
如雷的盛怒 = {
        'name': '如雷的盛怒',
        '理之冠': ['唤雷的头冠', '.\\sywtj\\rldsn_g.png'],
        '空之杯': ['降雷的凶兆', '.\\sywtj\\rldsn_b.png'],
        '时之沙': ['雷霆的时计', '.\\sywtj\\rldsn_s.png'],
        '死之羽': ['雷灾的孑遗', '.\\sywtj\\rldsn_y.png'],
        '生之花': ['雷鸟的怜悯', '.\\sywtj\\rldsn_h.png'],
        '套装效果': '获得15%雷元素伤害加成\n超载、感电、超导反应造成的伤害提升40%。触发这些元素反应时，元素战技冷却时间减少1秒。该效果每0.8秒最多触发一次'
        }
冰风迷途的勇士 = {
        'name': '冰风迷途的勇士',
        '理之冠': ['破冰踏雪的回音', '.\\sywtj\\bfmtdys_g.png'],
        '空之杯': ['遍结寒霜的傲骨', '.\\sywtj\\bfmtdys_b.png'],
        '时之沙': ['冰雪故园的终期', '.\\sywtj\\bfmtdys_s.png'],
        '死之羽': ['摧冰而行的执望', '.\\sywtj\\bfmtdys_y.png'],
        '生之花': ['历经风雪的思念', '.\\sywtj\\bfmtdys_h.png'],
        '套装效果': '获得15%冰元素伤害加成\n攻击处于冰元素影响状态下的敌人时，暴击率提高20%；若敌人处于冰冻状态下，暴击率额外提高20%'
        }
染血的骑士道 = {
        'name': '染血的骑士道',
        '理之冠': ['染血的铁假面', '.\\sywtj\\rxdqsd_g.png'],
        '空之杯': ['染血骑士之杯', '.\\sywtj\\rxdqsd_b.png'],
        '时之沙': ['骑士染血之时', '.\\sywtj\\rxdqsd_s.png'],
        '死之羽': ['染血的黑之羽', '.\\sywtj\\rxdqsd_y.png'],
        '生之花': ['染血的铁之心', '.\\sywtj\\rxdqsd_h.png'],
        '套装效果': '造成的物理伤害提高25%\n击败敌人后的10秒内，施放重击时不消耗体力，且造成的伤害提升50%'
        }
沉沦之心 = {
        'name': '沉沦之心',
        '理之冠': ['酒渍船帽', '.\\sywtj\\clzx_g.png'],
        '空之杯': ['沉波之盏', '.\\sywtj\\clzx_b.png'],
        '时之沙': ['坚铜罗盘', '.\\sywtj\\clzx_s.png'],
        '死之羽': ['追忆之风', '.\\sywtj\\clzx_y.png'],
        '生之花': ['饰金胸花', '.\\sywtj\\clzx_h.png'],
        '套装效果': '获得15%水元素伤害加成\n施放元素战技后的15秒内，普通攻击与重击造成的伤害提高30%'
        }
昔日宗室之仪 = {
        'name': '昔日宗室之仪',
        '理之冠': ['宗室面具', '.\\sywtj\\xrzszy_g.png'],
        '空之杯': ['宗室银瓮', '.\\sywtj\\xrzszy_b.png'],
        '时之沙': ['宗室时计', '.\\sywtj\\xrzszy_s.png'],
        '死之羽': ['宗室之翎', '.\\sywtj\\xrzszy_y.png'],
        '生之花': ['宗室之花', '.\\sywtj\\xrzszy_h.png'],
        '套装效果': '元素爆发造成的伤害提升20％\n施放元素爆发后，队伍中所有角色攻击力提升20％，持续12秒。该效果不可叠加'
        }
悠古的磐岩 = {
        'name': '悠古的磐岩',
        '理之冠': ['不动玄石之相', '.\\sywtj\\ygdpy_g.png'],
        '空之杯': ['巉岩琢塑之樽', '.\\sywtj\\ygdpy_b.png'],
        '时之沙': ['星罗圭璧之晷', '.\\sywtj\\ygdpy_s.png'],
        '死之羽': ['嵯峨群峰之翼', '.\\sywtj\\ygdpy_y.png'],
        '生之花': ['磐陀裂生之花', '.\\sywtj\\ygdpy_h.png'],
        '套装效果': '获得15%岩元素伤害加成\n获得结晶反应形成的晶片时，队伍中所有角色获得35%对应元素伤害加成，持续10秒。同时只能通过该效果获得一种元素伤害加成'
        }
苍白之火 = {
        'name': '苍白之火',
        '理之冠': ['嗤笑之面', '.\\sywtj\\cbzh_g.png'],
        '空之杯': ['超越之盏', '.\\sywtj\\cbzh_b.png'],
        '时之沙': ['停摆之刻', '.\\sywtj\\cbzh_s.png'],
        '死之羽': ['贤医之羽', '.\\sywtj\\cbzh_y.png'],
        '生之花': ['无垢之花', '.\\sywtj\\cbzh_h.png'],
        '套装效果': '造成的物理伤害提高25%\n元素战技命中敌人后，攻击力提升9%。该效果持续7秒，至多叠加2层，每0.3秒至多触发一次。叠满2层时，2件套的效果提升100%'
        }
翠绿之影 = {
        'name': '翠绿之影',
        '理之冠': ['翠绿的猎人之冠', '.\\sywtj\\clzy_g.png'],
        '空之杯': ['翠绿猎人的容器', '.\\sywtj\\clzy_b.png'],
        '时之沙': ['翠绿猎人的笃定', '.\\sywtj\\clzy_s.png'],
        '死之羽': ['猎人青翠的箭羽', '.\\sywtj\\clzy_y.png'],
        '生之花': ['野花记忆的绿野', '.\\sywtj\\clzy_h.png'],
        '套装效果': '获得15%风元素伤害加成\n扩散反应造成的伤害提升60%，根据扩散的元素类型，降低受到影响的敌人40%的对应元素抗性，持续10秒'
        }
四星圣遗物 = [
    战狂,
    流放者,
    行者之心,
    祭冰之人,
    奇迹,
    勇士之心,
    祭火之人,
    教官,
    赌徒,
    祭水之人,
    学士,
    武人,
    祭雷之人,
    守护之心,
    逆飞的流星,
    流浪大地的乐团,
    平息鸣雷的尊者,
    千岩牢固,
    渡过烈火的贤人,
    被怜爱的少女,
    炽烈的炎之魔女,
    角斗士的终幕礼,
    如雷的盛怒,
    冰风迷途的勇士,
    染血的骑士道,
    沉沦之心,
    昔日宗室之仪,
    悠古的磐岩,
    苍白之火,
    翠绿之影,
    ]

五星圣遗物 = [
    逆飞的流星,
    流浪大地的乐团,
    平息鸣雷的尊者,
    千岩牢固,
    渡过烈火的贤人,
    被怜爱的少女,
    炽烈的炎之魔女,
    角斗士的终幕礼,
    如雷的盛怒,
    冰风迷途的勇士,
    染血的骑士道,
    沉沦之心,
    昔日宗室之仪,
    悠古的磐岩,
    苍白之火,
    翠绿之影,
]

圣遗物 = [
    战狂,
    流放者,
    行者之心,
    祭冰之人,
    奇迹,
    勇士之心,
    祭火之人,
    教官,
    赌徒,
    祭水之人,
    学士,
    武人,
    祭雷之人,
    守护之心,
    逆飞的流星,
    流浪大地的乐团,
    平息鸣雷的尊者,
    千岩牢固,
    渡过烈火的贤人,
    被怜爱的少女,
    炽烈的炎之魔女,
    角斗士的终幕礼,
    如雷的盛怒,
    冰风迷途的勇士,
    染血的骑士道,
    沉沦之心,
    昔日宗室之仪,
    悠古的磐岩,
    苍白之火,
    翠绿之影,
    ]

主词条 = {
        '理之冠': ['暴击率', '暴击伤害', '元素精通', '攻击力(百分比)', '防御力(百分比)', '治疗加成'],
        '空之杯': [
                '攻击力(百分比)', '生命值(百分比)', '防御力(百分比)', '物理伤害加成', '风元素伤害加成', '岩元素伤害加成',
                '水元素伤害加成', '火元素伤害加成', '草元素伤害加成', '冰元素伤害加成', '雷元素伤害加成'],
        '时之沙': ['元素充能效率', '防御力(百分比)', '生命值(百分比)', '攻击力(百分比)'],
        '死之羽': ['攻击力(数值)'],
        '生之花': ['生命值(数值)']
}
副词条 = [
        '暴击率', '暴击伤害', '元素精通', '元素充能效率', '攻击力(数值)', '攻击力(百分比)',
        '防御力(数值)', '防御力(百分比)', '生命值(数值)', '生命值(百分比)'
]
圣遗物词条 = [
        主词条,
        副词条
]
